app/controllers/contacts_controller.rb

SELECT "contacts".* FROM "contacts" WHERE "contacts"."user_id" = $1  [["user_id", 13]]
---
  def index
    @contacts = current_user.contacts.all

INSERT INTO "contacts" ("first_name", "last_name", "number", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["first_name", "Jesse"], ["last_name", "Smo"], ["number", "9852853305"], ["user_id", 13], ["created_at", "2016-02-16 18:47:29.475985"], ["updated_at", "2016-02-16 18:47:29.475985"]]
---
  def create
    @contact = current_user.contacts.create(contact_params)

SELECT  "contacts".* FROM "contacts" WHERE "contacts"."user_id" = $1 AND "contacts"."id" = $2 LIMIT 1  [["user_id", 13], ["id", 19]]
---
  def edit
    @contact = current_user.contacts.find(params[:id])

SELECT  "contacts".* FROM "contacts" WHERE "contacts"."id" = $1 LIMIT 1  [["id", 30]]
---
  def update
      @contact = Contact.find(params[:id])

DELETE FROM "contacts" WHERE "contacts"."id" = $1  [["id", 31]]
SELECT  "contacts".* FROM "contacts" WHERE "contacts"."id" = $1 LIMIT 1  [["id", 31]]
---
  def destroy
    @contact = Contact.find(params[:id]).destroy