app/controllers/messages_controller.rb

SELECT "resources".* FROM "resources"
---
  def new
    @contacts = current_user.contacts
    @source = Resource.all

SELECT  "contacts".* FROM "contacts" WHERE "contacts"."id" = $1 LIMIT 1  [["id", 101]]
SELECT  "resources".* FROM "resources" WHERE "resources"."id" = $1 LIMIT 1  [["id", 1]]
---
  def create
    @contact = Contact.find(params[:id])
    @source = Resource.find(params[:api_id])