app/controllers/users_controller.rb

SELECT  "users".* FROM "users" LIMIT 1
---
  def index
    @users = User.all

INSERT INTO "users" ("first_name", "last_name", "email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    @user = User.new(user_params)
    if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 13]]
UPDATE "users" SET "first_name" = $1, "last_name" = $2, "password_digest" = $3, "updated_at" = $4 WHERE "users"."id" = $5  [["first_name", "thingy"], ["last_name", "things"], ["password_digest", "$2a$10$wQkFUUaFwan0z.HTALhpSeql/5Dt3F/5kAKj3.Xnm3S2NBlhSSJ0e"], ["updated_at", "2016-02-17 07:13:27.297597"], ["id", 25]]
---
  def update
    @user = User.find(params[:id])
    if @user.update_attributes(user_params)